In [1]:
import pandas as pd

In [5]:
data1=pd.read_excel(r'C:\Users\admin\Desktop\MYdata1.xlsx')

In [6]:
data1

    NAME  AGE   SALARY
0    RAM   30  2000000
1   NAMI   20  3000000
2  PARUL   25   500000
3     OM   36   400000

In [8]:
data2=pd.read_csv(r'C:\Users\admin\Desktop\MY.DATA2.csv')

In [9]:
data2

   roll no.    name  batch
0      1001      om   1840
1      1002  namah    1850
2      1003  shivay   1860
3      1004    piku   1843

In [11]:
data3=pd.read_csv(r'C:\Users\admin\Desktop\MYDATA3.tsv',sep='\t')

In [12]:
data3

   ROLLNO.   NAME  BATCH
0     1001     OM   1840
1     1002  PARUL   1850
2     1003    LEO   1860
3     1004   NEHA   1875

In [13]:
data3=pd.read_csv(r'C:\Users\admin\Desktop\MYDATA3.tsv')

In [14]:
data3

  ROLLNO.\tNAME\tBATCH
0       1001\tOM\t1840
1    1002\tPARUL\t1850
2      1003\tLEO\t1860
3     1004\tNEHA\t1875